renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
/***********************************************************************************************************************
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/

#if (USE_SERIAL_TERM == 1)
/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include "bsp_api.h"

#if BSP_PERIPHERAL_UARTA_PRESENT
#include "r_uarta.h"
#include <string.h>

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
#ifndef UARTA_CFG_RX_ENABLE
 #define UARTA_CFG_RX_ENABLE               1
#endif
#ifndef UARTA_CFG_TX_ENABLE
 #define UARTA_CFG_TX_ENABLE               1
#endif

/* "UART" in ASCII.  Used to determine if the control block is open. */
#define UARTA_OPEN                         (0x55415254)

/* UARTA parity bit mapping */
#define UARTA_PARITY_OFF_MAPPING           (0U)
#define UARTA_PARITY_ZERO_MAPPING          (1U)
#define UARTA_PARITY_ODD_MAPPING           (2U)
#define UARTA_PARITY_EVEN_MAPPING          (3U)

#define UARTA_MAX_TRANSFER_BYTES           (0x10000)

/* Number of clock select and divider */
#define UARTA_UATCK_UATSEL_COUNT           (4U)

/* Mask for valid mapping of uart_clock_div_t to UTA0CK.CK */
#define UARTA_CLOCK_DIV_MASK               (0x07U)

/* Maximum and minimum BRGCA*/
#define UARTA_BRGCA_MAX                    (255)
#define UARTA_BRGCA_MIN                    (2)

/* Mask 2 bit for bit UTA0CK.SEL[1:0] */
#define UARTA_UTA0SEL_MASK                 (0x03U)

/* DTC transfer setting information */
#define UARTA_DTC_RX_TRANSFER_SETTINGS     ((TRANSFER_MODE_NORMAL << TRANSFER_SETTINGS_MODE_BITS) |                \
                                            (TRANSFER_SIZE_1_BYTE << TRANSFER_SETTINGS_SIZE_BITS) |                \
                                            (TRANSFER_ADDR_MODE_FIXED << TRANSFER_SETTINGS_SRC_ADDR_BITS) |        \
                                            (TRANSFER_IRQ_END << TRANSFER_SETTINGS_IRQ_BITS) |                     \
                                            (TRANSFER_ADDR_MODE_INCREMENTED << TRANSFER_SETTINGS_DEST_ADDR_BITS) | \
                                            (TRANSFER_REPEAT_AREA_DESTINATION << TRANSFER_SETTINGS_REPEAT_AREA_BITS))
#define UARTA_DTC_TX_TRANSFER_SETTINGS     ((TRANSFER_MODE_NORMAL << TRANSFER_SETTINGS_MODE_BITS) |               \
                                            (TRANSFER_SIZE_1_BYTE << TRANSFER_SETTINGS_SIZE_BITS) |               \
                                            (TRANSFER_ADDR_MODE_INCREMENTED << TRANSFER_SETTINGS_SRC_ADDR_BITS) | \
                                            (TRANSFER_IRQ_END << TRANSFER_SETTINGS_IRQ_BITS) |                    \
                                            (TRANSFER_ADDR_MODE_FIXED << TRANSFER_SETTINGS_DEST_ADDR_BITS) |      \
                                            (TRANSFER_REPEAT_AREA_SOURCE << TRANSFER_SETTINGS_REPEAT_AREA_BITS))

/* Wait time needs to be rounded up to enable TX/RX. */
#define UARTA_CONVERT_TO_MICRO_SECOND      (999999U)

#define UARTA_MAX_BAUD_RATE_ERROR_10PPM    (4740U)

/* Scaling factor for baud rate error values, 10ppm or .001% */
#define UARTA_BAUD_ERROR_SCALING_10PPM     (100000)

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
 #define UARTA_MAX_BAUD_RATE               (153600)
#endif

/***********************************************************************************************************************
 * Private constants
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/

#if defined(__ARMCC_VERSION) || defined(__ICCARM__)
typedef void (BSP_CMSE_NONSECURE_CALL * uarta_prv_ns_callback)(uart_callback_args_t * p_args);
#elif defined(__GNUC__)
typedef BSP_CMSE_NONSECURE_CALL void (*volatile uarta_prv_ns_callback)(uart_callback_args_t * p_args);
#endif

/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)

static fsp_err_t r_uarta_read_write_param_check(uarta_instance_ctrl_t const * const p_ctrl,
                                                uint8_t const * const               addr,
                                                uint32_t const                      bytes);

 #if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)
static fsp_err_t r_uarta_operation_clock_validation(uarta_baud_setting_t const * const p_baud_setting);

 #endif

#endif

#if UARTA_CFG_DTC_SUPPORT_ENABLE
static fsp_err_t r_uarta_transfer_configure(uarta_instance_ctrl_t * const p_ctrl);
static fsp_err_t r_uarta_transfer_configure_helper(uarta_instance_ctrl_t     * p_ctrl,
                                                   transfer_instance_t const * p_transfer,
                                                   uart_dir_t                  direction);

#endif

static void r_uarta_baud_set(uarta_instance_ctrl_t * p_ctrl, uarta_baud_setting_t const * const p_baud_setting);

static void r_uarta_call_callback(uarta_instance_ctrl_t * p_ctrl, uint32_t data, uart_event_t event);

static uint16_t r_uarta_calculate_wait_time(uarta_baud_setting_t const * const p_baud_setting);

#if (UARTA_CFG_RX_ENABLE)

void uarta_rxi_isr(void);
void uarta_eri_isr(void);

#endif

#if (UARTA_CFG_TX_ENABLE)

void uarta_txi_isr(void);

#endif

