renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/

/** Look-up table for parity values */
static const uint8_t uarta_parity_lut[] =
{
    [UART_PARITY_OFF]  = UARTA_PARITY_OFF_MAPPING << R_UARTA0_ASIMAn1_PS_Pos,
    [UART_PARITY_ZERO] = UARTA_PARITY_ZERO_MAPPING << R_UARTA0_ASIMAn1_PS_Pos,
    [UART_PARITY_EVEN] = UARTA_PARITY_EVEN_MAPPING << R_UARTA0_ASIMAn1_PS_Pos,
    [UART_PARITY_ODD]  = UARTA_PARITY_ODD_MAPPING << R_UARTA0_ASIMAn1_PS_Pos
};

/** Look-up table for converting UARTA clock source, used to get the clock value from R_BSP_SourceClockHzGet */
static fsp_priv_source_clock_t uarta_f_uta0_sel_lut[] =
{
    [UARTA_CLOCK_SOURCE_SOSC_LOCO] = FSP_PRIV_CLOCK_LOCO,
    [UARTA_CLOCK_SOURCE_SOSC]      = FSP_PRIV_CLOCK_SUBCLOCK,
    [UARTA_CLOCK_SOURCE_MOSC]      = FSP_PRIV_CLOCK_MAIN_OSC,
    [UARTA_CLOCK_SOURCE_HOCO]      = FSP_PRIV_CLOCK_HOCO,
    [UARTA_CLOCK_SOURCE_MOCO]      = FSP_PRIV_CLOCK_MOCO
};

#if (UARTA_CFG_RX_ENABLE)

/** Look-up table for event types */
static const uint8_t uarta_event_lut[] =
{
    [0] = 0,
    [1] = UART_EVENT_ERR_OVERFLOW,
    [2] = UART_EVENT_ERR_FRAMING,
    [3] = UART_EVENT_ERR_OVERFLOW | UART_EVENT_ERR_FRAMING,
    [4] = UART_EVENT_ERR_PARITY,
    [5] = UART_EVENT_ERR_PARITY | UART_EVENT_ERR_OVERFLOW,
    [6] = UART_EVENT_ERR_PARITY | UART_EVENT_ERR_FRAMING,
    [7] = UART_EVENT_ERR_OVERFLOW | UART_EVENT_ERR_FRAMING | UART_EVENT_ERR_PARITY
};

 #define UARTA_ASISA_RCVR_ERR_MASK    (R_UARTA0_ASISAn_OVEA_Msk | R_UARTA0_ASISAn_FEA_Msk | R_UARTA0_ASISAn_PEA_Msk)

#endif

/* UART on UARTA HAL API mapping for UART interface */
const uart_api_t g_uart_on_uarta =
{
    .open               = R_UARTA_Open,
    .close              = R_UARTA_Close,
    .write              = R_UARTA_Write,
    .read               = R_UARTA_Read,
    .infoGet            = R_UARTA_InfoGet,
    .baudSet            = R_UARTA_BaudSet,
    .communicationAbort = R_UARTA_Abort,
    .callbackSet        = R_UARTA_CallbackSet,
    .readStop           = R_UARTA_ReadStop,
};

/*******************************************************************************************************************//**
 * @addtogroup UARTA
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Configures the UARTA driver based on the input configurations. If transmission/reception is enabled at compile time,
 * transmission/reception is enabled at the end of this function. Implements @ref uart_api_t::open
 *
 * @retval  FSP_SUCCESS                    Channel opened successfully.
 * @retval  FSP_ERR_ASSERTION              Pointer to UARTA control block or configuration structure is NULL.
 * @retval  FSP_ERR_IP_CHANNEL_NOT_PRESENT The requested channel does not exist on this MCU.
 * @retval  FSP_ERR_INVALID_ARGUMENT       Invalid clock select (f_UTA0) and baudrate configuration.
 * @retval  FSP_ERR_ALREADY_OPEN           Control block has already been opened or channel is being used by another
 *                                         instance. Call close() then open() to reconfigure.
 *
 * @return                       See @ref RENESAS_ERROR_CODES or functions called by this function for other possible
 *                               return codes. This function calls:
 *                                   * @ref transfer_api_t::open
 **********************************************************************************************************************/
fsp_err_t R_UARTA_Open (uart_ctrl_t * const p_api_ctrl, uart_cfg_t const * const p_cfg)
{
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t               err    = FSP_SUCCESS;

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)

    /* Check parameters. */
    FSP_ASSERT(p_ctrl);
    FSP_ASSERT(p_cfg);
    FSP_ASSERT(p_cfg->p_extend);
    FSP_ASSERT(((uarta_extended_cfg_t *) p_cfg->p_extend)->p_baud_setting);
    FSP_ERROR_RETURN(UARTA_OPEN != p_ctrl->open, FSP_ERR_ALREADY_OPEN);

    /* Make sure this channel exists. */
    FSP_ERROR_RETURN(((1 << p_cfg->channel) & BSP_PERIPHERAL_UARTA_CHANNEL_MASK), FSP_ERR_IP_CHANNEL_NOT_PRESENT);

    FSP_ASSERT(p_cfg->rxi_irq >= 0);
    FSP_ASSERT(p_cfg->txi_irq >= 0);

 #if (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE == 0)

    /* UARTA0_ERRI interrupt request should be greater than 0 when Receive Error Interrupt Mode is disabled */
    FSP_ASSERT(p_cfg->eri_irq >= 0);
 #endif

 #if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)

    /* Validate the f_uta before setting the baud rate*/
    FSP_ERROR_RETURN(FSP_SUCCESS ==
                     r_uarta_operation_clock_validation(((uarta_extended_cfg_t *) p_cfg->p_extend)->p_baud_setting),
                     FSP_ERR_INVALID_ARGUMENT);
 #endif
#endif

    p_ctrl->p_cfg             = p_cfg;
    p_ctrl->p_callback        = p_cfg->p_callback;
    p_ctrl->p_context         = p_cfg->p_context;
    p_ctrl->p_callback_memory = NULL;

#if (BSP_PERIPHERAL_UARTA_CHANNEL_MASK > 1)

    /* Calculate the register base address. */
    uint32_t address_gap = (uint32_t) R_UARTA1 - (uint32_t) R_UARTA0;
    p_ctrl->p_reg = (R_UARTA0_Type *) ((uint32_t) R_UARTA0 + (address_gap * p_cfg->channel));
#else
    p_ctrl->p_reg = R_UARTA0;
#endif

#if UARTA_CFG_DTC_SUPPORT_ENABLE

    /* Configure the transfer interface for transmission and reception if provided. */
    err = r_uarta_transfer_configure(p_ctrl);

    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#endif

    /* Enable the UARTA channel */
    R_BSP_MODULE_START(FSP_IP_UARTA, 0);

