renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
    /* Set the UART configuration settings provided in ::uart_cfg_t and :: uarta_extended_cfg_t. */
    uarta_extended_cfg_t * p_extend = (uarta_extended_cfg_t *) p_ctrl->p_cfg->p_extend;

    /* Set the baud rate settings for the internal baud rate generator. */
    r_uarta_baud_set(p_ctrl, p_extend->p_baud_setting);

    /* Setting parity, length, stop, direction, and level bit */
    p_ctrl->p_reg->ASIMAn1 = (uint8_t) (uarta_parity_lut[p_cfg->parity] |
                                        ((uint8_t) (p_cfg->data_bits << R_UARTA0_ASIMAn1_CL_Pos)) |
                                        ((uint8_t) (p_cfg->stop_bits << R_UARTA0_ASIMAn1_SL_Pos)) |
                                        ((uint8_t) (p_extend->transfer_dir << R_UARTA0_ASIMAn1_DIR_Pos)) |
                                        ((uint8_t) (p_extend->transfer_level << R_UARTA0_ASIMAn1_ALV_Pos)));

    /* Setting interrupt for continuous transmission and receive interrupt mode select */
    uint8_t asima0 = (uint8_t) ((R_UARTA0_ASIMAn0_ISSMA_Msk) |
                                ((uint8_t) (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE << R_UARTA0_ASIMAn0_ISRMA_Pos)));

    /* Configure for register ASIMA0 */
    p_ctrl->p_reg->ASIMAn0 = asima0;

    /* Enables the UARTA operation clock */
    asima0                |= R_UARTA0_ASIMAn0_EN_Msk;
    p_ctrl->p_reg->ASIMAn0 = asima0;

#if (UARTA_CFG_RX_ENABLE)
    p_ctrl->rx_dest_bytes = 0;

    /* If reception is enabled at build time, enable reception. */
    asima0 |= R_UARTA0_ASIMAn0_RXEA_Msk;
#endif

#if (UARTA_CFG_TX_ENABLE)
    p_ctrl->tx_src_bytes = 0;

    /* If transmission is enabled at build time, enable transmission. */
    asima0 |= R_UARTA0_ASIMAn0_TXEA_Msk;
#endif

    p_ctrl->p_reg->ASIMAn0 = asima0;

#if (UARTA_CFG_RX_ENABLE)
 #if (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE == 0)
    R_BSP_IrqCfgEnable(p_cfg->eri_irq, p_cfg->eri_ipl, p_ctrl);
 #endif
    R_BSP_IrqCfgEnable(p_cfg->rxi_irq, p_cfg->rxi_ipl, p_ctrl);
#endif

#if (UARTA_CFG_TX_ENABLE)

    /* Wait for at least one cycle of the UARTA operation clock
     * See in hardware manual: UARTA > Register Descriptions > ASIMA00 > Note */
    R_BSP_SoftwareDelay(p_extend->p_baud_setting->delay_time, BSP_DELAY_UNITS_MICROSECONDS);

    R_BSP_IrqCfgEnable(p_cfg->txi_irq, p_cfg->txi_ipl, p_ctrl);
#endif

    p_ctrl->open = UARTA_OPEN;

    return err;
}

/*******************************************************************************************************************//**
 * Aborts any in progress transfers. Disables interrupts, receiver, and transmitter.  Closes lower level transfer
 * drivers if used. Removes power. Implements @ref uart_api_t::close
 *
 * @retval  FSP_SUCCESS              Channel successfully closed.
 * @retval  FSP_ERR_ASSERTION        Pointer to UARTA control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN         The control block has not been opened
 **********************************************************************************************************************/
fsp_err_t R_UARTA_Close (uart_ctrl_t * const p_api_ctrl)
{
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_ctrl);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    uart_cfg_t const * p_cfg = p_ctrl->p_cfg;

    /* Mark UARTA not open so it can be used again. */
    p_ctrl->open = 0;

    /* Disable receiver, and transmitter. */
    uint8_t current_value = p_ctrl->p_reg->ASIMAn0;

    /* Do read-modify-write for TXEA/RXEA */
    current_value &= (uint8_t) ~(R_UARTA0_ASIMAn0_TXEA_Msk | R_UARTA0_ASIMAn0_RXEA_Msk);

    p_ctrl->p_reg->ASIMAn0 = current_value;

    /* Disable baud clock output. Must be done separately after disabling TX/RX. */
    p_ctrl->p_reg->ASIMAn0 = (uint8_t) (current_value & ~R_UARTA0_ASIMAn0_EN_Msk);

#if (UARTA_CFG_RX_ENABLE)
 #if (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE == 0)
    R_BSP_IrqDisable(p_cfg->eri_irq);
 #endif

    /* If reception is enabled at build time, disable reception irqs. */
    R_BSP_IrqDisable(p_cfg->rxi_irq);
#endif
#if (UARTA_CFG_TX_ENABLE)

    /* If transmission is enabled at build time, disable transmission irqs. */
    R_BSP_IrqDisable(p_cfg->txi_irq);
#endif

#if UARTA_CFG_DTC_SUPPORT_ENABLE
 #if (UARTA_CFG_RX_ENABLE)
    transfer_instance_t const * p_transfer_rx = p_cfg->p_transfer_rx;
    if (NULL != p_transfer_rx)
    {
        p_transfer_rx->p_api->close(p_transfer_rx->p_ctrl);
    }
 #endif
 #if (UARTA_CFG_TX_ENABLE)
    transfer_instance_t const * p_transfer_tx = p_cfg->p_transfer_tx;
    if (NULL != p_transfer_tx)
    {
        p_transfer_tx->p_api->close(p_transfer_tx->p_ctrl);
    }
 #endif
#endif

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Receives user specified number of bytes into destination buffer pointer. Implements @ref uart_api_t::read
 *
 * @retval  FSP_SUCCESS                  Data reception successfully ends.
 * @retval  FSP_ERR_ASSERTION            Pointer to UARTA control block is NULL.
 *                                       Number of transfers outside the max or min boundary when transfer instance used
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened
 * @retval  FSP_ERR_IN_USE               A previous read operation is still in progress.
 * @retval  FSP_ERR_UNSUPPORTED          UARTA_CFG_RX_ENABLE is set to 0
 *
 * @return                       See @ref RENESAS_ERROR_CODES or functions called by this function for other possible
 *                               return codes. This function calls:
 *                                   * @ref transfer_api_t::reset
 *
 **********************************************************************************************************************/
fsp_err_t R_UARTA_Read (uart_ctrl_t * const p_api_ctrl, uint8_t * const p_dest, uint32_t const bytes)
{
#if (UARTA_CFG_RX_ENABLE)
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t               err    = FSP_SUCCESS;

 #if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    err = r_uarta_read_write_param_check(p_ctrl, p_dest, bytes);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
    FSP_ERROR_RETURN(0U == p_ctrl->rx_dest_bytes, FSP_ERR_IN_USE);
 #endif

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
    transfer_instance_t const * p_transfer_rx = p_ctrl->p_cfg->p_transfer_rx;

