renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Updates the baud rate using the clock selected in Open. p_baud_setting is a pointer to a uarta_baud_setting_t
 * structure.
 * Implements @ref uart_api_t::baudSet
 *
 * @warning This terminates any in-progress transmission.
 *
 * @retval  FSP_SUCCESS                  Baud rate was successfully changed.
 * @retval  FSP_ERR_ASSERTION            Pointer to UARTA control block is NULL or the UART is not configured to use the
 *                                       internal clock.
 * @retval  FSP_ERR_INVALID_ARGUMENT       Invalid clock select (f_UTA0) and baudrate configuration.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened
 **********************************************************************************************************************/
fsp_err_t R_UARTA_BaudSet (uart_ctrl_t * const p_api_ctrl, void const * const p_baud_setting)
{
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_ctrl);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
 #if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)
    FSP_ERROR_RETURN(FSP_SUCCESS ==
                     r_uarta_operation_clock_validation(p_baud_setting),
                     FSP_ERR_INVALID_ARGUMENT);
 #endif
#endif

    /* Disable transmit interrupt.  Resuming transmission after reconfiguring baud settings is
     * not supported. */
    R_BSP_IrqDisable(p_ctrl->p_cfg->txi_irq);

    uint8_t preserved_asiman0 = p_ctrl->p_reg->ASIMAn0;

    /* Modify the BRGCAn bits while the TXEAn and RXEAn bits are 0 (in the transmission/reception stopped state).*/
    p_ctrl->p_reg->ASIMAn0 = (preserved_asiman0 & (uint8_t) (~(R_UARTA0_ASIMAn0_RXEA_Msk | R_UARTA0_ASIMAn0_TXEA_Msk)));

    /* Apply new baud rate register settings. */
    r_uarta_baud_set(p_ctrl, p_baud_setting);

    /* To enable transmission or reception again, set the TXEAn or RXEAn bit to 1 at least two cycles of the UARTAn
     * operation clock after clearing the TXEAn or RXEAn bit to 0
     * See in hardware manual: UARTA > Register Descriptions > ASIMA00 > Note */
    uint16_t delay_time = r_uarta_calculate_wait_time(p_baud_setting);
    R_BSP_SoftwareDelay((uint32_t) delay_time << 1U, BSP_DELAY_UNITS_MICROSECONDS);

    /* Restore all settings. */
    p_ctrl->p_reg->ASIMAn0 = preserved_asiman0;
#if (UARTA_CFG_TX_ENABLE)

    /* If transmission is enabled at build time, enable transmission. */
    if (preserved_asiman0 & R_UARTA0_ASIMAn0_TXEA_Msk)
    {
        /* Wait for at least one cycle of the UARTA operation clock
         * See in hardware manual: UARTA > Register Descriptions > ASIMA00 > Note */
        R_BSP_SoftwareDelay((uint32_t) delay_time, BSP_DELAY_UNITS_MICROSECONDS);
    }
#endif

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Provides the driver information, including the maximum number of bytes that can be received or transmitted at a time.
 * Implements @ref uart_api_t::infoGet
 *
 * @retval  FSP_SUCCESS                  Information stored in provided p_info.
 * @retval  FSP_ERR_ASSERTION            Pointer to UART control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened
 **********************************************************************************************************************/
fsp_err_t R_UARTA_InfoGet (uart_ctrl_t * const p_api_ctrl, uart_info_t * const p_info)
{
#if UARTA_CFG_PARAM_CHECKING_ENABLE
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;
    FSP_ASSERT(p_ctrl);
    FSP_ASSERT(p_info);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
#endif

    p_info->read_bytes_max  = UARTA_MAX_TRANSFER_BYTES;
    p_info->write_bytes_max = UARTA_MAX_TRANSFER_BYTES;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Provides API to abort ongoing transfer. Transmission is aborted after the current character is transmitted.
 * Reception is still enabled after abort(). Any characters received after abort() and before the transfer
 * is reset in the next call to read(), will arrive via the callback function with event UART_EVENT_RX_CHAR.
 * Implements @ref uart_api_t::communicationAbort
 *
 * @retval  FSP_SUCCESS                  UARTA transaction aborted successfully.
 * @retval  FSP_ERR_ASSERTION            Pointer to UARTA control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened.
 * @retval  FSP_ERR_UNSUPPORTED          The requested Abort direction is unsupported.
 *
 * @return                       See @ref RENESAS_ERROR_CODES or functions called by this function for other possible
 *                               return codes. This function calls: @ref transfer_api_t::disable
 **********************************************************************************************************************/
fsp_err_t R_UARTA_Abort (uart_ctrl_t * const p_api_ctrl, uart_dir_t communication_to_abort)
{
#if (UARTA_CFG_PARAM_CHECKING_ENABLE) || (UARTA_CFG_TX_ENABLE) || (UARTA_CFG_RX_ENABLE)
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;
#endif
    fsp_err_t err = FSP_ERR_UNSUPPORTED;

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_ctrl);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

#if (UARTA_CFG_TX_ENABLE)
    if (UART_DIR_TX & communication_to_abort)
    {
        err = FSP_SUCCESS;

        R_BSP_IrqDisable(p_ctrl->p_cfg->txi_irq);

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
        transfer_instance_t const * p_transfer_tx = p_ctrl->p_cfg->p_transfer_tx;
        if (NULL != p_transfer_tx)
        {
            err = p_transfer_tx->p_api->disable(p_transfer_tx->p_ctrl);
            FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
        }
 #endif
        p_ctrl->tx_src_bytes = 0;
    }
#endif

#if (UARTA_CFG_RX_ENABLE)
    if (UART_DIR_RX & communication_to_abort)
    {
        err = FSP_SUCCESS;

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
        transfer_instance_t const * p_transfer_rx = p_ctrl->p_cfg->p_transfer_rx;
        if (NULL != p_transfer_rx)
        {
            err = p_transfer_rx->p_api->disable(p_transfer_rx->p_ctrl);
        }
 #endif
        p_ctrl->rx_dest_bytes = 0U;
    }
#endif

