renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
    return err;
}

/*******************************************************************************************************************//**
 * Provides API to abort ongoing read. Reception is still enabled after abort(). Any characters received after abort()
 * and before the transfer is reset in the next call to read(), will arrive via the callback function with event
 * UART_EVENT_RX_CHAR.
 * Implements @ref uart_api_t::readStop
 *
 * @retval  FSP_SUCCESS                  UARTA transaction aborted successfully.
 * @retval  FSP_ERR_ASSERTION            Pointer to UARTA control block is NULL.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened.
 * @retval  FSP_ERR_UNSUPPORTED          The requested Abort direction is unsupported.
 *
 * @return                       See @ref RENESAS_ERROR_CODES or functions called by this function for other possible
 *                               return codes. This function calls: @ref transfer_api_t::disable
 **********************************************************************************************************************/
fsp_err_t R_UARTA_ReadStop (uart_ctrl_t * const p_api_ctrl, uint32_t * p_remaining_bytes)
{
#if (UARTA_CFG_RX_ENABLE)
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) p_api_ctrl;

 #if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_ctrl);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
 #endif

    uint32_t remaining_bytes = p_ctrl->rx_dest_bytes;
    p_ctrl->rx_dest_bytes = 0;

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
    transfer_instance_t const * p_transfer_rx = p_ctrl->p_cfg->p_transfer_rx;
    if (NULL != p_transfer_rx)
    {
        fsp_err_t err = p_transfer_rx->p_api->disable(p_transfer_rx->p_ctrl);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

        transfer_properties_t transfer_info;
        err = p_transfer_rx->p_api->infoGet(p_transfer_rx->p_ctrl, &transfer_info);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
        remaining_bytes = transfer_info.transfer_length_remaining;
    }
 #endif

    *p_remaining_bytes = remaining_bytes;

    return FSP_SUCCESS;
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(p_remaining_bytes);

    return FSP_ERR_UNSUPPORTED;
#endif
}

/*******************************************************************************************************************//**
 * Calculates baud rate register settings. Evaluates and determines the best possible settings set to the baud rate
 * related registers.
 *
 * @param[in]  baudrate                      Baud rate [bps]. For example, 19200, 57600, 115200, etc.
 * @param[in]  baud_rate_percent_error_x1000 Max baud rate error. At most baud_rate_percent_error x 1000 required
 *                                           for module to function. Absolute max baud_rate_error is 4740 (4.74%).
 * @param[in]  clock_source                  Clock Source. Required for module to generate baudrate. The clock sources
 *                                           can be select include UARTA_CLOCK_SOURCE_MOSC, UARTA_CLOCK_SOURCE_HOCO,
 *                                           UARTA_CLOCK_SOURCE_MOCO, UARTA_CLOCK_SOURCE_SOSC_LOCO.
 * @param[out] p_baud_setting                Baud setting information stored here if successful
 *
 * @retval     FSP_SUCCESS               Baud rate is set successfully
 * @retval     FSP_ERR_ASSERTION         Null pointer
 * @retval     FSP_ERR_INVALID_ARGUMENT  Argument is out of available range, baud rate is '0'.
 * @retval     FSP_ERR_INVALID_RATE      Baud rate error is outside the range or the baud rate could not be set given
 *                                       the current clock source.
 **********************************************************************************************************************/
fsp_err_t R_UARTA_BaudCalculate (uint32_t                     baudrate,
                                 uint32_t                     baud_rate_percent_error_x1000,
                                 uarta_clock_source_t         clock_source,
                                 uarta_baud_setting_t * const p_baud_setting)
{
#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(p_baud_setting);
    FSP_ERROR_RETURN(UARTA_MAX_BAUD_RATE_ERROR_10PPM >= baud_rate_percent_error_x1000, FSP_ERR_INVALID_ARGUMENT);
    FSP_ERROR_RETURN(UARTA_MAX_BAUD_RATE >= baudrate, FSP_ERR_INVALID_ARGUMENT);
    FSP_ERROR_RETURN((0U != baudrate), FSP_ERR_INVALID_ARGUMENT);
#endif

    fsp_err_t ret = FSP_ERR_INVALID_RATE;

    /* UARTA_MAX_BAUD_RATE * UARTA_MAX_BAUD_RATE_ERROR_10PPM < UINT32_MAX */
    uint32_t delta_max = baudrate * baud_rate_percent_error_x1000 / UARTA_BAUD_ERROR_SCALING_10PPM;

    uint32_t clock_source_value = R_BSP_SourceClockHzGet(uarta_f_uta0_sel_lut[clock_source]);

#if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)
    uint32_t pclk_constraint = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_PCLKB);
#endif

    /* Go ahead and set the clock source here. It stays constant through the baud rate search. */
    p_baud_setting->utanck_clock_b.utasel = (uint8_t) (clock_source & UARTA_UTA0SEL_MASK);

    for (uarta_clock_div_t f_uta0_div = UARTA_CLOCK_DIV_1; f_uta0_div < UARTA_CLOCK_DIV_COUNT; f_uta0_div++)
    {
        /* Calculate UARTA operation clock (f_UTA0)*/
        uint32_t f_uta0_value = clock_source_value >> f_uta0_div;

        /* Find the appropriate divider for the requested baud rate.
         * divider = round(f_UTA0 / (2 * Desired baud rate))
         * Integer round to the nearest divider.
         */
        uint32_t divider = ((f_uta0_value + baudrate) >> 1) / baudrate;
        if ((divider >= UARTA_BRGCA_MIN) && (divider <= UARTA_BRGCA_MAX)
#if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)
            && (f_uta0_value <= pclk_constraint)
#endif
            )
        {
            /* Calculate actual baudrate using the divider. */
            uint32_t actual_baudrate = (f_uta0_value >> 1) / divider;
            uint32_t delta           = baudrate >=
                                       actual_baudrate ? (baudrate - actual_baudrate) : (actual_baudrate - baudrate);
            if (delta < delta_max)
            {
                delta_max                             = delta;
                p_baud_setting->brgca                 = (uint8_t) divider;
                p_baud_setting->utanck_clock_b.utanck = (uint8_t) (f_uta0_div & R_UARTA_CK_UTAnCK_CK_Msk);
                ret = FSP_SUCCESS;
            }
        }

        if (UARTA_CLOCK_SOURCE_LOCO == clock_source)
        {
            p_baud_setting->utanck_clock_b.utanck = UARTA_UTAnCK_LOCO_SETTING;
            break;
        }

#if (!BSP_FEATURE_BSP_HAS_FSXP_CLOCK)
        if (UARTA_CLOCK_SOURCE_SOSC == clock_source)
        {
            p_baud_setting->utanck_clock_b.utanck = UARTA_UTAnCK_SOSC_SETTING;
            break;
        }
#endif
    }

    return ret;
}

/*******************************************************************************************************************//**
 * @} (end addtogroup UARTA)
 **********************************************************************************************************************/

