renesas/ra-fsp-examples/example_projects/ek_ra2e1/i2c_addr_match_wakeup/i2c_master_addr_match_wakeup_ek_ra2e1_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
    /* Set fSEL clock select */
    R_UARTA_CK->UTAnCK_b[0].SEL = p_baud_setting->utanck_clock_b.utasel;
#endif
}

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)
 #if (BSP_FEATURE_UARTA_PCLK_RESTRICTION)

/*******************************************************************************************************************//**
 * Validates the baud rate divisor for the given UARTA clock frequency against PCLK constraints.
 *
 * This function checks if the UARTA operation clock (derived from the frequency settings of the baud rate generator)
 * is within acceptable limits as defined by the PCLK.
 *
 * @param[in]  p_baud_setting       Pointer to the baud rate settings structure which includes the UARTA clock selection.
 * @retval FSP_SUCCESS              The UARTA operation clock is within acceptable limits.
 * @retval FSP_ERR_INVALID_ARGUMENT The UARTA operation clock exceeds PCLK constraints.
 **********************************************************************************************************************/
static fsp_err_t r_uarta_operation_clock_validation (uarta_baud_setting_t const * const p_baud_setting)
{
    /* Retrieve the PCLKB constraint and operation clock uarta value */
    uint32_t pclk_constraint    = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_PCLKB);
    uint32_t clock_source_value = R_BSP_SourceClockHzGet(uarta_f_uta0_sel_lut[p_baud_setting->utanck_clock_b.utasel]);
    uint32_t f_uta              = clock_source_value >> (p_baud_setting->utanck_clock_b.utanck & UARTA_CLOCK_DIV_MASK);

    /* Check if UARTA operation clock exceeds the PCLK constraint */
    if (f_uta > pclk_constraint)
    {
        return FSP_ERR_INVALID_ARGUMENT;
    }

    return FSP_SUCCESS;
}

 #endif
#endif

/*******************************************************************************************************************//**
 * This function calculates the wait time to enable TX
 *
 * @param[in] p_baud_setting         Pointer to baud rate settings.
 **********************************************************************************************************************/
static uint16_t r_uarta_calculate_wait_time (uarta_baud_setting_t const * const p_baud_setting)
{
    uint8_t utanck = p_baud_setting->utanck_clock_b.utanck;
    uint8_t utasel = p_baud_setting->utanck_clock_b.utasel;

    /* Get UARTA clock divider shift.
     * Anything outside UARTA_CLOCK_DIV_MASK is not a valid divider and is probably LOCO/SOSC selection instead.
     */
    uint32_t divider_shift = (uint32_t) (utanck & UARTA_CLOCK_DIV_MASK);

    /* Calculate frequency UARTA0 operation clock */
    uint32_t f_uta0 = (R_BSP_SourceClockHzGet(uarta_f_uta0_sel_lut[utasel]) >> divider_shift);

    /* Round up especially for the use case f_uta0 > UARTA_CONVERT_TO_MICRO_SECOND */
    return (uint16_t) ((UARTA_CONVERT_TO_MICRO_SECOND + f_uta0) / f_uta0);
}

/*******************************************************************************************************************//**
 * Calls user callback.
 *
 * @param[in]     p_ctrl     Pointer to UARTA instance control block
 * @param[in]     data       See uart_callback_args_t in r_uart_api.h
 * @param[in]     event      Event code
 **********************************************************************************************************************/
static void r_uarta_call_callback (uarta_instance_ctrl_t * p_ctrl, uint32_t data, uart_event_t event)
{
    if (NULL != p_ctrl->p_callback)
    {
        uart_callback_args_t args;

        /* Store callback arguments in memory provided by user if available.  This allows callback arguments to be
         * stored in non-secure memory so they can be accessed by a non-secure callback function. */
        uart_callback_args_t * p_args = p_ctrl->p_callback_memory;
        if (NULL == p_args)
        {
            /* Store on stack */
            p_args = &args;
        }
        else
        {
            /* Save current arguments on the stack in case this is a nested interrupt. */
            args = *p_args;
        }

        p_args->channel   = p_ctrl->p_cfg->channel;
        p_args->data      = data;
        p_args->event     = event;
        p_args->p_context = p_ctrl->p_context;

#if BSP_TZ_SECURE_BUILD

        /* p_callback can point to a secure function or a non-secure function. */
        if (!cmse_is_nsfptr(p_ctrl->p_callback))
        {
            /* If p_callback is secure, then the project does not need to change security state. */
            p_ctrl->p_callback(p_args);
        }
        else
        {
            /* If p_callback is Non-secure, then the project must change to Non-secure state in order to call the callback. */
            uarta_prv_ns_callback p_callback = (uarta_prv_ns_callback) (p_ctrl->p_callback);
            p_callback(p_args);
        }

#else

        /* If the project is not Trustzone Secure, then it will never need to change security state in order to call the callback. */
        p_ctrl->p_callback(p_args);
#endif
        if (NULL != p_ctrl->p_callback_memory)
        {
            /* Restore callback memory in case this is a nested interrupt. */
            *p_ctrl->p_callback_memory = args;
        }
    }
}

#if (UARTA_CFG_TX_ENABLE)

/*******************************************************************************************************************//**
 * TXI interrupt processing for UART mode. TXI interrupt fires when:
 * - The data in the data register has been transferred to the data shift register, and the next data can be
 * written (ISSMAn = 1). This interrupt writes the next data. After the last data byte is written, set ISSMAn = 0.
 * - After the last byte is transmitted on the TX pin (ISSMAn = 0). The user callback function is called with
 * the UART_EVENT_TX_COMPLETE event code (if it is registered in R_UARTA_Open()).
 **********************************************************************************************************************/
void uarta_txi_isr (void)
{
    /* Save context if RTOS is used */
    FSP_CONTEXT_SAVE;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

